In [135]:
import numpy as np
import pandas as pd

### Viewing Data

In [136]:
# creating dataframe 

data = {
    "Name":["Priti","Puja","Ram" ,"shyam" ,"hari"],
    "age":[21,33,26,32,30],
    "city":["ktm","Bkt","Bkr","ltr","ktm"]
}
df = pd.DataFrame(data)
print(df)

    Name  age city
0  Priti   21  ktm
1   Puja   33  Bkt
2    Ram   26  Bkr
3  shyam   32  ltr
4   hari   30  ktm

In [137]:
# printing first two elements of the data
df.head(2)

    Name  age city
0  Priti   21  ktm
1   Puja   33  Bkt

In [138]:
#printing last three elements of the data
df.tail(3)

    Name  age city
2    Ram   26  Bkr
3  shyam   32  ltr
4   hari   30  ktm

In [139]:
#getting information about data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [140]:
#getting statistics discription of the data
df.describe()

             age
count   5.000000
mean   28.400000
std     4.929503
min    21.000000
25%    26.000000
50%    30.000000
75%    32.000000
max    33.000000

### Selecting Data

In [141]:
# Selecting one column
df["Name"]

0    Priti
1     Puja
2      Ram
3    shyam
4     hari
Name: Name, dtype: object

In [142]:
# select multiple column
df[["Name","age"]]

    Name  age
0  Priti   21
1   Puja   33
2    Ram   26
3  shyam   32
4   hari   30

In [143]:
# selecting roes by index
df.loc[2]

Name    Ram
age      26
city    Bkr
Name: 2, dtype: object

### Filtering Data

In [144]:
# filtering rows where age is greater than 25
print(df["age"] > 25)
df[df["age"]>25]

0    False
1     True
2     True
3     True
4     True
Name: age, dtype: bool

    Name  age city
1   Puja   33  Bkt
2    Ram   26  Bkr
3  shyam   32  ltr
4   hari   30  ktm

In [145]:
# filter rows where city is ktm
df[df["city"]=="ktm"]

    Name  age city
0  Priti   21  ktm
4   hari   30  ktm

In [146]:
# filtering where age is greater than 25 and city is ktm
df[(df["city"]=="ktm") & (df["age"]>25)]

   Name  age city
4  hari   30  ktm

### Adding & Modifying Columns

In [147]:
df["score"] = [85, 90, 75, 85, 95]
print(df)

    Name  age city  score
0  Priti   21  ktm     85
1   Puja   33  Bkt     90
2    Ram   26  Bkr     75
3  shyam   32  ltr     85
4   hari   30  ktm     95

In [148]:
# change values in column ( making all the string in age lower case)
print(df)
df["city"] = df["city"].str.lower()
print(df)

    Name  age city  score
0  Priti   21  ktm     85
1   Puja   33  Bkt     90
2    Ram   26  Bkr     75
3  shyam   32  ltr     85
4   hari   30  ktm     95
    Name  age city  score
0  Priti   21  ktm     85
1   Puja   33  bkt     90
2    Ram   26  bkr     75
3  shyam   32  ltr     85
4   hari   30  ktm     95

In [149]:
# update a single cell-(0)
df.at[0,"age"]=18
print(df)

    Name  age city  score
0  Priti   18  ktm     85
1   Puja   33  bkt     90
2    Ram   26  bkr     75
3  shyam   32  ltr     85
4   hari   30  ktm     95

### sorting data

In [150]:
# sort by age
df.sort_values(by="age")

    Name  age city  score
0  Priti   18  ktm     85
2    Ram   26  bkr     75
4   hari   30  ktm     95
3  shyam   32  ltr     85
1   Puja   33  bkt     90

In [151]:
# sorting by age in ascending order
df.sort_values(by="age",ascending= False)

    Name  age city  score
1   Puja   33  bkt     90
3  shyam   32  ltr     85
4   hari   30  ktm     95
2    Ram   26  bkr     75
0  Priti   18  ktm     85

### Removing Data

In [153]:
# removing column

df.drop(columns="score", inplace=True)
print(df)

    Name  age city
0  Priti   18  ktm
1   Puja   33  bkt
2    Ram   26  bkr
3  shyam   32  ltr
4   hari   30  ktm

In [154]:
# remove a row
df.drop(index=2, inplace=True)